№ 2.1
123(int) - да
1E6(int) = 10^6
123456789LU - unsigned long
-5(int) - да
0XFUL(unsigned long) = 15
'0'(char) = 48
058 - неправильное восьмиричное число 
'\x7'(char) = 7
0X-1AD - нет 
'\122'(char) = 0122 = 82 
00123(int) = 83
0xffffffL(long) = 16777215
01A - нет
-'x'(char) = -120
"x" = 4195828
'a'U - нет, применить unsigned к char нельзя 
0731UL(int) = 473
'\n'(char) = 10
+0xaf(int) = 175
0X0(int) = 0
---------------------------------------------------------------

№ 2.2
1.71(float) - да
1E-6(float) = 10^-6
0.314159E1F(float) = 3.141590
.005(float) = 0.005
0051E-04(float) = 0.0051
5.E+2(float) = 500
0e0(float) = 0
0x1A1.5 - нет
05.5(float) = 5.5
0(float) = 0
0X1E6(float) = 486
0F - нет
1234.56789L(long float) = 1234.56789
1.0E-10D(double) = 10^-10
3.1415U - нет, unsigned к float
1e-2f(float) = 0.01
-12.3E-6(float) = -0.0000123
+10e6(float) = 10000000
123456L = 123456
E-6 - нет
------------------------------------------------------------------

№ 2.3
int a, b, c, d, e;	
a = 2;  b = 13;  c = 7;  d = 19;  e = -4;

1)b / a / c	= 0

2)d / a % c = 2

3)c % d-e = 11

4)-e % a + b / a *-5+5 = -25

5)b % e = 1

6)7-d%+(3-a) = 7

7)b % - e * c = 7

8)9 / c - - 20 / d = 2
-----------------------------------------------------------------------

№ 2.4
int a, c;  c = 5;
a) c ++; a = 2 * c; - да (6,12)

b) a = 2 * c++;	- нет (10)

c) c += 1; a = c + c; - да (6,12)

d) a = c++ + c;	- нет (11)

e) ++c; a = c + c; - да (6,12)

f) a = ++ c + c; - да (6,12)

g) a = c += 1 + c; - нет (11)

h) a = (c+=1)+c; - да (6,12)
--------------------------------------------------------------------------

№ 2.5
int a, c; c = 5;
a) -- c ; a = c / 2; - да  (4,2)

b) a = -- c / 2; - да  (4,2)

c) c -= 1; a = c % 2;	- нет (0)

d) a = c -- / 2; - да  (4,2)

e) a = c -= 1/2; - нет (5)

f) a = (c = c - 1)/2; - да  (4,2)

g) a = (c -= 1)/2; - да  (4,2)	

h) a=(c-= 1)/2.0; - да  (4,2)	
----------------------------------------------------------------------------

№ 2.6
a)	E1 op= E2		и		E1 = E1 op E2 - Эквивалентны
b) 	E1 op= E2		и		E1 = E1 op (E2) - Эквивалентны
----------------------------------------------------------------------------

№ 2.7
int a, b, c;  
a = 2;  b = 6;  c = 3;
1)- - - a (-2)

2)-- - a  - нет

3)b-- - a (4)

4)a += a ++ (5)

5)++ b / a ++ * --c (6)

6)a --- b (-4)

7)- a-- -b (-8)

8)a ++ = b - нет

9)a = a ++ (2)

10)b++ / ++a * c -- (6)

11)- --a (-1)

12)a- --c (0)

13)a ++ = a - нет

14)++ a = b - нет

15)a = ( b + 1 ) ++ - нет
--------------------------------------------------------------------------

№ 2.8
int  i,  j,  k, m;  
char c, d;   
i = 1;  j = 2;  k = -7; m = 0; c = ‘w’; 
1)d = ’a’+1 < c	(1)

2)m = - i - 5 * j >= k+1 (0)

3)i + j++  + k = = -2*j - нет

4)m = 3 < j < 5	(1)

5)m = 3 = = j < 5 - нет	

6)m = = c = ’w’ - нет

7)m = c != 87 (1)	

8)m = c = ! 87	(0)		

9)m = ! c = 87 - нет

10)m = !c+87 (87)	

11)! m = =c + 87 - нет		

12)m ! = c + 87 - нет

13)k = = j - 9 = = i - нет	

14)k *= 3 + j (-35)		

15)i + j = !k - нет

16)i += ++ j + 3 (7)	

17)k %= m = 1 + n / 2 - нет

18)1 + 3 * n += 7 / 5 - нет

19)1 + 3 * (n += 7) / 5	- нет

20)c + i < c - ‘x’+10 (0)	

21)i - k = = ‘0’+9 < 10 - нет
-----------------------------------------------------------------------------

№ 2.9
not (not x) = x - !(!x) == x - да - закон двойного отрицания 
x and true = x - x && true == x - да - равносильные операции
-----------------------------------------------------------------------------

№ 2.10
Сложение имеете больший приоритет,нежели стравнение => да
-----------------------------------------------------------------------------

№ 2.11
! ( a>b )  -  a<=b

! ( 2*a == b+4 )  -  2*a != b+4

! ( a<b && c<d )  -  a>=b || c>=d

! ( a<2 || a>5)  -  a>=2 && a<=5

! ( a<1 || b<2 && c<3 )  -  a>=1 && b>=2 || c>=3
-------------------------------------------------------------------------------

№ 2.12
char c;      short s;     int i;       unsigned u;            signed char sc; 
float f;     double d;    long lng;    unsigned short us;     long double ld;

c - s / i  -  int
u * 3 - 3.0 * u - i  -  double
u - us * i  -  int
( sc + d ) * ld  -  long double
(5 * lng - 'a' ) * ( s + u / 2 )  -  long
( f + 3 ) / ( 2.5f - s * 3.14)  -  double
--------------------------------------------------------------------------------

№ 2.13
a)  int i;
    i = (1 || 2) % (1 | 2 );
    printf ( "i = %d\n", i);

    (1)

b)  int a, b, m, n, z;
    m = n = 5;
    z = a = b = 0;
    z--, ( a = b ) = z + ( m != n );
    printf ("%d %d %d %d %d\n", a, b, m, n, z);
    
    (нет)

c)  int i = 1;
    i = i << i | i;
    printf ("i = %d\n", i);

    (3)

d)  double x = 1.9; int a;
    double b = 3.7;
    a = b += (1 && 2 || 3) != (int)x;
    printf ("%f %d %f\n", x, a, b);

    (1.900000 3 3.700000)

e)  int x;
    x = 5; ++ x =10;
    printf ("%d\n", x);

    (нет)

f)  int i, x, y; x = 5; y = 10; i = 15;
    x = ( y = 0, i = 1);
    printf("%d %d %d\n", i, x ,y);
    ( x = y == 0) , i=1;
    printf("%d %d %d\n", i, x, y);

    (1 1 0
     1 1 0)

g)  int x, y;
    x = 5; y = x && ++ x;
    printf("%d %d\n", x, y);

    (6 1)

h)  int x = 2, y, z;
    x *= 3+2; x *= y = z = 4;
    printf ("%d %d %d\n", x, y, z);
    x = y == z; x == ( y = z );
    printf ("%d %d %d\n", x, y, z);

    (40 4 4
     1 4 4)

i)  int x = 2, y = 1, z = 0;
    y = x && y || z;
    x = x || !y && z;
    z = x / ++x;
    printf("%d %d %d\n", x, y, z);

    (2 1 1)

j)  int x = 03, y = 02, z = 01;
    printf("%d\n", x | y & -z);
    printf("%d\n", x ^ y & -z);
    printf("%d\n", x & y && z);
    printf("%d\n", x<<3);

    (3
    1
    1
    24)

k)  int x, y, z; x = y = z = 1;
    x += y += z;
    printf("%d\n", x < y ? y++ : x++);
    printf("%d\n", z+=x<y ? ++x : y--);
    printf("%d %d %d\n", x, y, z);
    printf("%d\n", z>=y && y>=x);

    (3
    3
    4 1 3
    0)

l)  int x, y, z, i; x = y = z = 1;
    i = ++x || ++y && ++z;
    printf("%d%d%d%d\n", x,y,z,i);
    i = x++ <= --y || ++z >= i;
    printf("%d%d%d%d\n", x,y,z,i);

    (2111
    3021)
------------------------------------------------------------------------------------

№ 2.14

s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
s = 5653 i = 333333 lng = 333333 f = 333333.000000 d = 333333.000000
s = 5653 i = 5653 lng = 5653 f = 5653.000000 d = 5653.000000
s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
s = 33 i = 33 lng = 33 f = 33.333332 d = 33.333333
s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
s = 33 i = 33 lng = 33 f = 33.000000 d = 33.000000
------------------------------------------------------------------------------------

№ 2.15

x = 2.000000 ;y = 1
x = 1 ;y = 2.000000
x = 1.600000 ;y = 3
x = 0.781250; y = 2
x = 0 y = 0.000000
------------------------------------------------------------------------------------

№ 2.16
Дано вещественное число x . Не пользуясь никакими операциями, кроме умножения, сложения и вычитания, вычислить
2x^4-3x^3+4x^2-5x+6.
Разрешается использовать не более четырех умножений и четырех сложений и вычитаний.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	double x, y;
    printf("x = ");
    scanf("%lf", &x);
    y = 2 * x * x * x * x - 3 * x * x * x + 4 * x * x - 5 * x + 6; 
    printf("y = %lf", y);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.17
Целой переменной k присвоить значение, равное третьей от конца цифре в записи целого положительного числа x.

include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int x, k;
    printf("x = ");
    scanf("%d", &x);
    k = x / 100 % 10;
    printf("k = %d", k);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.18
Целой переменной k присвоить значение, равное сумме цифр в записи целого положительного трехзначного числа x.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	int x,k,a,b,c;
    printf("x = ");
    scanf("%d", &x);
    a = x%10;
    b = x/10%10;
    c = x/100%10;
    k = a+b+c;
    printf("k = %d", k);
    return 0;
}

------------------------------------------------------------------------------------

№ 2.19
Целой переменной k присвоить значение, равное первой цифре дробной части в записи вещественного положительного числа x.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	double x;
    int k;
    printf("x = ");
    scanf("%lf", &x);
    k = x * 10;
    k %= 10;
    printf("k = %d", k);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.20
Определить число, полученное выписыванием в обратном порядке цифр заданного целого трехзначного числа.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
	int x;
    printf("x = ");
    scanf("%d", &x);
    printf("x = %d",x/100+x/10%10*10+x%10*100);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.21
Идет n-ая секунда суток. Определить, сколько полных часов и полных минут прошло к этому моменту.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int s, h, m;
    printf("s = ");
    scanf("%d", &s);
    m = s / 60;
    h = m / 60;
    m-= h * 60;
    printf("hours = %d\nminutes = %d", h, m);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.22
Дано вещественное число x . Не пользуясь никакими операциями, кроме умножения, получить
a) 	x21 за шесть операций

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    long x, y;
    printf ("x = ");
    scanf ("%ld", &x);
    y = x * x * x;
    y = y * y * x;
    y = y * y * y;
    printf ("y = %ld", y);
    return 0;
}

b) 	x3 и x10 за четыре операции

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    long x, y, z;
    printf ("x = ");
    scanf ("%ld", &x);
    z = x * x;
    y = z * x;
    printf ("y = %ld\n", y);
    y = z * y;
    y = y * y;
    printf ("y = %ld", y);
    return 0;
}

c) 	x5 и x13 за пять операций

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    long x, y, z;
    printf ("x = ");
    scanf ("%ld", &x);
    y = x * x;
    z = y * x;
    y = z * y;
    printf ("y = %ld\n", y);
    y = y * y * z;
    printf ("y = %ld", y);
    return 0;
}

d) 	x2, x5 и x17 за шесть операций

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    long x, y, z;
    printf ("x = ");
    scanf ("%ld", &x);
    y = x * x;
    printf ("y = %ld\n", y);
    z = y * y;
    y = z * x;
    printf ("y = %ld\n", y);
    z = z * z;
    y = z * z * x;
    printf ("y = %ld", y);
    return 0;
}

e) 	x4, x12 и x28 за шесть операций

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    long x, y, z;
    printf ("x = ");
    scanf ("%ld", &x);
    y = x * x;
    z = y = y * y;
    printf ("y = %ld\n", y);
    y = y * y;
    y = z * y;
    printf ("y = %ld\n", y);
    y = y * y;
    y = y * z;
    printf ("y = %ld", y);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.23
Выражения, соединенные операциями && и || , по правилам Си вычисляются слева направо; вычисления прекращаются, как только становится известна истинность или ложность результата. В других языках программирования, например в Паскале, вычисляются все части выражения в любом случае. Приведите «за» и «против» каждого из этих решений.

За: экономия процессорного времени
Против: может произойти ошибка,если есть вложенные операции
------------------------------------------------------------------------------------

№ 2.24
Почему в Си не допускается, чтобы один и тот же литерал-перечислитель входил в два различных перечислимых типа? Могут ли совпадать имена литералов-перечислителей и имена обычных переменных в одной области видимости? Могут ли разные литералы-перечислители иметь одинаковые значения?

Элементы пречисления находятся в одной области видимости => дноименные перечислители вызовут конфликт имен
Нет, поскольку перечислители в той же области будут равносильны переменным по правилам именования.
Да, так как значения перечислителей могут назначаться автоматически.
------------------------------------------------------------------------------------

№ 2.25
«Упаковать» четыре символа в беззнаковое целое. Длина беззнакового целого равна 4.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    char a, b, c, d;
    int x;
    scanf("%c%c%c%c", &a, &b, &c, &d);
    x = d | c << 8 | b << 16 | a << 24;
    printf("%#x\n%d", x, x);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.26
«Распаковать» беззнаковое целое число в четыре символа. Длина беззнакового целого равна 4.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    char a, b, c, d;
    int x;
    scanf("%d", &x);
    d = x;
    c = x >> 8;
    b = x >> 16;
    a = x >> 24;
    printf("%c%c%c%c", a, b, c, d);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.27
Заменить в целочисленной переменной x n бит, начиная с позиции p, n старшими инвертированными битами целочисленной переменной y.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int n, p, x, y, i, m = 0xFFFFFFFF;
    scanf("%d%d%x%x", &n, &p, &x, &y);
    y = ~y;
    for (i = n; i; m <<= 1, i--);
    for (i = n; i < p; i++)
    {
        m <<= 1;
        m += 1;
    }

    y <<= (32 - n);
    x >>= (p - n);
    x |= y;
    x >>= 1;
    x &= m;
    printf("X=%x\n", x);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.28
Циклически сдвинуть значение целочисленной величины на n позиций вправо.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int x, n;
    scanf("%d%d", &x, &n);
    x >>= n;
    printf("x = %d", x);
    return 0;
}
------------------------------------------------------------------------------------

№ 2.29
Циклически сдвинуть значение целочисленной величины на n позиций влево.

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int x, n;
    scanf("%d%d", &x, &n);
    x <<= n;
    printf("x = %d", x);
    return 0;
}
------------------------------------------------------------------------------------
№ 2.30
Выясните некоторые свойства и особенности поведения доступного Вам транслятора Си:
a) выяснить, сколько байт отведено для хранения данных типа short, int, long, float, double и long double;
short - 2
int - 4
long - 8
float - 4
double - 8
long double - 16

b) выяснить способ представления типа char ( signed-  или unsigned- вариант );

-signed char

c) проконтролировать, все ли способы записи констант допустимы:
•	целых ( обычная форма записи, u/U, l/L, их комбинации; запись констант в восьмеричной и шестнадцатиричной системах счисления )
•	вещественных ( обычная форма записи, в экспоненциальном виде, f/F, l/L, e/E )
•	символьных ( обычная форма записи, с помощью эскейп-последовательности ) и строковых ( в частности, происходит ли конкатенация рядом расположенных строковых констант )

-да 

d) выяснить, как упорядочены коды символов '0' - '9', 'a' - 'z', 'A' - 'Z', пробел (между собой и относительно друг друга);

  char	     int
'0' - '9'	48-57
'a' - 'z'	97-122
'A' - 'Z'	65-90
   space	  32
e) проконтролировать, происходит ли инициализация переменных по умолчанию;

-да, нулевым значением

f) проверить, реагирует ли транслятор на попытку изменить константу;

-да 

g) исследовать особенности выполнения операции % с отрицательными операндами;

-левый операнд влияет, правый - нет

h) проверьте, действительно ли операции отношения  ==  и != имеют более низкий приоритет, чем все другие операции отношения;

-да

i) проверьте, действительно ли выполняется правило "ленивых вычислений" выражений в Си, т.е. прекращается ли вычисление выражений с логическими операциями, если возможно "досрочно" установить значение результата;

-да

j) проверьте, все ли виды операнда операции sizeof (X), определяемые стандартом для арифметических типов, допускаются компилятором; действительно ли выражение X не вычисляется.

-да
